# Threat Report: 2025-07-23: OSINT -  Disrupting active exploitation of on-premises SharePoint vulnerabilities


## Key Intelligence
* Date: 2025-07-23
* Threat Level: 1 (High)
* Tags: misp-galaxy:threat-actor="APT31", misp-galaxy:threat-actor="Emissary Panda", type:OSINT, osint:lifetime="perpetual", osint:certainty="50", tlp:white, tlp:clear, misp-galaxy:threat-actor="Storm-2603", misp-galaxy:mitre-attack-pattern="Exploit Public-Facing Application - T1190", misp-galaxy:mitre-attack-pattern="PowerShell - T1059.001", misp-galaxy:mitre-attack-pattern="Web Shell - T1505.003", misp-galaxy:mitre-attack-pattern="Reflective Code Loading - T1620", misp-galaxy:mitre-attack-pattern="Automated Collection - T1119", misp-galaxy:producer="Microsoft"

---

## Indicators of Compromise (IOCs)
### External analysis
* vulnerability: CVE-2025-53770
* vulnerability: CVE-2025-49704
* vulnerability: CVE-2025-53771
* vulnerability: CVE-2025-49706

### Network activity
* ip-dst: 134.199.202.205 — IP address exploiting SharePoint vulnerabilities
* ip-dst: 104.238.159.149 — IP address exploiting SharePoint vulnerabilities
* ip-dst: 188.130.206.168 — IP address exploiting SharePoint vulnerabilities
* ip-dst: 131.226.2.6 — Post exploitation C2
* url: c34718cbb4c6.ngrok-free.app/file.ps1 — Ngrok tunnel delivering PowerShell to C2

### Payload delivery
* sha256: <sha256> — Hash of spinstall0.aspx

## Objects
### vulnerability — Vulnerability object describing a common vulnerability enumeration which can describe published, unpublished, under review or embargo vulnerability for software, equipments or hardware.
* [External analysis] link: https://vulnerability.circl.lu/vuln/CVE-2025-49706
* [External analysis] vulnerability: CVE-2025-49706
* [Other] datetime: 2025-07-08T16:58:07.343000+00:00
* [Other] datetime: 2025-07-23T03:55:22.461000+00:00
* [Other] text: PUBLISHED
* [External analysis] link: https://msrc.microsoft.com/update-guide/vulnerability/CVE-2025-49706

### vulnerability — Vulnerability object describing a common vulnerability enumeration which can describe published, unpublished, under review or embargo vulnerability for software, equipments or hardware.
* [External analysis] link: https://vulnerability.circl.lu/vuln/CVE-2025-53771
* [External analysis] vulnerability: CVE-2025-53771
* [Other] datetime: 2025-07-20T22:16:52.203000+00:00
* [Other] datetime: 2025-07-22T21:03:27.322000+00:00
* [Other] text: PUBLISHED
* [External analysis] link: https://msrc.microsoft.com/update-guide/vulnerability/CVE-2025-53771

### vulnerability — Vulnerability object describing a common vulnerability enumeration which can describe published, unpublished, under review or embargo vulnerability for software, equipments or hardware.
* [External analysis] link: https://vulnerability.circl.lu/vuln/CVE-2025-49704
* [External analysis] vulnerability: CVE-2025-49704
* [Other] datetime: 2025-07-08T16:58:05.908000+00:00
* [Other] datetime: 2025-07-22T21:04:05.006000+00:00
* [Other] text: PUBLISHED
* [External analysis] link: https://msrc.microsoft.com/update-guide/vulnerability/CVE-2025-49704

### vulnerability — Vulnerability object describing a common vulnerability enumeration which can describe published, unpublished, under review or embargo vulnerability for software, equipments or hardware.
* [External analysis] link: https://vulnerability.circl.lu/vuln/CVE-2025-49704
* [External analysis] vulnerability: CVE-2025-49704
* [Other] datetime: 2025-07-08T16:58:05.908000+00:00
* [Other] datetime: 2025-07-22T21:04:05.006000+00:00
* [Other] text: PUBLISHED
* [External analysis] link: https://msrc.microsoft.com/update-guide/vulnerability/CVE-2025-49704

### vulnerability — Vulnerability object describing a common vulnerability enumeration which can describe published, unpublished, under review or embargo vulnerability for software, equipments or hardware.
* [External analysis] link: https://vulnerability.circl.lu/vuln/CVE-2025-53770
* [External analysis] vulnerability: CVE-2025-53770
* [Other] datetime: 2025-07-20T01:06:33.607000+00:00
* [Other] datetime: 2025-07-23T03:55:21.046000+00:00
* [Other] text: PUBLISHED
* [External analysis] link: https://msrc.microsoft.com/update-guide/vulnerability/CVE-2025-53770

### file — File object describing a file with meta-information
* [Other] text: \1[5-6]\TEMPLATE\LAYOUTS\debug_dev.js

### file — File object describing a file with meta-information
* [Payload delivery] filename: debug_dev.js — File containing web config data, including MachineKey data
* [Other] text: Malicious

### file — File object describing a file with meta-information
* [Payload delivery] filename: Spinstall0.aspx — Web shell used by threat actors   Actors have also modified the file name in a variety of ways, such as spinstall.aspx, spinstall1.aspx, spinstall2.aspx

### query — An object describing a query, along with its format.
* [Other] text: Sentinel Advanced Security Information Model
* [Other] text: //IP list and domain list- _Im_NetworkSession
let lookback = 30d;
let ioc_ip_addr = dynamic(["131.226.2.6", "134.199.202.205", "104.238.159.149", "188.130.206.168"]);
let ioc_domains = dynamic(["c34718cbb4c6.ngrok-free.app"]);
_Im_NetworkSession(starttime=todatetime(ago(lookback)), endtime=now())
| where DstIpAddr in (ioc_ip_addr) or DstDomain has_any (ioc_domains)
| summarize imNWS_mintime=min(TimeGenerated), imNWS_maxtime=max(TimeGenerated),
  EventCount=count() by SrcIpAddr, DstIpAddr, DstDomain, Dvc, EventProduct, EventVendor

### query — An object describing a query, along with its format.
* [Other] text: Sentinel Advanced Security Information Model
* [Other] text: //IP list - _Im_WebSession
let lookback = 30d;
let ioc_ip_addr = dynamic(["131.226.2.6", "134.199.202.205", "104.238.159.149", "188.130.206.168"]);
let ioc_sha_hashes =dynamic(["92bb4ddb98eeaf11fc15bb32e71d0a63256a0ed826a03ba293ce3a8bf057a514"]);
_Im_WebSession(starttime=todatetime(ago(lookback)), endtime=now())
| where DstIpAddr in (ioc_ip_addr) or FileSHA256 in (ioc_sha_hashes)
| summarize imWS_mintime=min(TimeGenerated), imWS_maxtime=max(TimeGenerated),
  EventCount=count() by SrcIpAddr, DstIpAddr, Url, Dvc, EventProduct, EventVendor

### query — An object describing a query, along with its format.
* [Other] text: Sentinel Advanced Security Information Model
* [Other] text: // file hash list - imFileEvent
let ioc_sha_hashes = dynamic(["92bb4ddb98eeaf11fc15bb32e71d0a63256a0ed826a03ba293ce3a8bf057a514"]);
imFileEvent
| where SrcFileSHA256 in (ioc_sha_hashes) or TargetFileSHA256 in (ioc_sha_hashes)
| extend AccountName = tostring(split(User, @'')[1]), 
  AccountNTDomain = tostring(split(User, @'')[0])
| extend AlgorithmType = "SHA256"

### query — An object describing a query, along with its format.
* [Other] text: Microsoft Defender XDR
* [Other] text: DeviceFileEvents 
| where FolderPath has_any ("microsoft shared\\Web Server Extensions\\15\\TEMPLATE\\LAYOUTS", "microsoft shared\\Web Server Extensions\\16\\TEMPLATE\\LAYOUTS") 
| where FileName contains "spinstall"
| project Timestamp, DeviceName, InitiatingProcessFileName, InitiatingProcessCommandLine, FileName, FolderPath, ReportId, ActionType, SHA256 
| order by Timestamp desc

### query — An object describing a query, along with its format.
* [Other] text: Microsoft Defender XDR
* [Other] text: DeviceProcessEvents
| where InitiatingProcessFileName has "w3wp.exe"
    and InitiatingProcessCommandLine !has "DefaultAppPool"
    and FileName =~ "cmd.exe"
    and ProcessCommandLine has_all ("cmd.exe", "powershell")
    and ProcessCommandLine has_any ("EncodedCommand", "-ec")
| extend CommandArguments = split(ProcessCommandLine, " ")
| mv-expand CommandArguments to typeof(string)
| where CommandArguments matches regex "^[A-Za-z0-9+/=]{15,}$"
| extend B64Decode = replace("\\x00", "", base64_decodestring(tostring(CommandArguments)))   
| where B64Decode contains "spinstall", @'C:\PROGRA~1\COMMON~1\MICROS~1\WEBSER~1\15\TEMPLATE\LAYOUTS', @'C:\PROGRA~1\COMMON~1\MICROS~1\WEBSER~1\16\TEMPLATE\LAYOUTS')

### query — An object describing a query, along with its format.
* [Other] text: Microsoft Defender XDR
* [Other] text: DeviceFileEvents
| where Timestamp >ago(7d)
| where InitiatingProcessFileName=~"powershell.exe"
| where FileName contains "spinstall"

### query — An object describing a query, along with its format.
* [Other] text: Microsoft Defender XDR
* [Other] text: AlertEvidence 
| where Timestamp > ago(7d) 
| where Title has "SuspSignoutReq" 
| extend _DeviceKey = iff(isnotempty(DeviceId), bag_pack_columns(DeviceId, DeviceName),"") 
| summarize min(Timestamp), max(Timestamp), count_distinctif(DeviceId,isnotempty(DeviceId)), make_set(Title), make_set_if(_DeviceKey, isnotempty(_DeviceKey) )

### query — An object describing a query, along with its format.
* [Other] text: Microsoft Defender XDR
* [Other] text: DeviceTvmSoftwareVulnerabilities 
| where CveId in ("CVE-2025-49704","CVE-2025-49706","CVE-2025-53770","CVE-2025-53771")
